In [2]:
import pandas as pd 
df=pd.read_csv(r"C:\Users\KEDARI\Downloads\niha.csv")
df

    Name  Age      GROUP
0   NIHA   23       bcom
1  surya   24        bca
2   raju   35         ds
3   ravi   24         cs
4   kavs   25         ds
5    sri   26         cs
6    sai   27  fisheries
7  meena   32         ai
8   sita   12         ai

In [6]:
df["Age"].max()

35

In [7]:
df["Age"].min()

12

In [8]:
df["Age"].mean()

np.float64(25.333333333333332)

In [9]:
df["Age"].describe()

count     9.000000
mean     25.333333
std       6.403124
min      12.000000
25%      24.000000
50%      25.000000
75%      27.000000
max      35.000000
Name: Age, dtype: float64

In [10]:
import pandas as pd
df[df.Age==df.Age.max()]

   Name  Age GROUP
2  raju   35    ds

In [11]:
df.count()

Name     9
Age      9
GROUP    9
dtype: int64

In [13]:
df['GROUP'].nunique()

6

In [14]:
df['GROUP'].unique()

array(['bcom', 'bca', 'ds', 'cs', 'fisheries', 'ai'], dtype=object)

In [15]:
df['GROUP'].value_counts()

GROUP
ds           2
cs           2
ai           2
bcom         1
bca          1
fisheries    1
Name: count, dtype: int64

### String Cleaning

In [17]:
import pandas as pd
df=pd.read_csv(r"C:\Users\KEDARI\Downloads\niha.csv")
df

    Name  Age      GROUP
0   NIHA   23       bcom
1  surya   24        bca
2   raju   35         ds
3   ravi   24         cs
4   kavs   25         ds
5    sri   26         cs
6    sai   27  fisheries
7  meena   32         ai
8   sita   12         ai

In [18]:
df['GROUP']=df['GROUP'].str.upper()
df

    Name  Age      GROUP
0   NIHA   23       BCOM
1  surya   24        BCA
2   raju   35         DS
3   ravi   24         CS
4   kavs   25         DS
5    sri   26         CS
6    sai   27  FISHERIES
7  meena   32         AI
8   sita   12         AI

In [19]:
df['GROUP']=df['GROUP'].str.lower()
df

    Name  Age      GROUP
0   NIHA   23       bcom
1  surya   24        bca
2   raju   35         ds
3   ravi   24         cs
4   kavs   25         ds
5    sri   26         cs
6    sai   27  fisheries
7  meena   32         ai
8   sita   12         ai

In [20]:
df['Name'].str.lower()

0     niha
1    surya
2     raju
3     ravi
4     kavs
5      sri
6      sai
7    meena
8     sita
Name: Name, dtype: object

In [21]:
df['GROUP']=df['GROUP'].str.replace("fisheries","chem")
df

    Name  Age GROUP
0   NIHA   23  bcom
1  surya   24   bca
2   raju   35    ds
3   ravi   24    cs
4   kavs   25    ds
5    sri   26    cs
6    sai   27  chem
7  meena   32    ai
8   sita   12    ai

### Concatenate DataFrames

In [22]:
india=pd.DataFrame({
    "city": ["Mumbai","Agra","Banglore"],
    "temp": [34,23,45]
})
india

       city  temp
0    Mumbai    34
1      Agra    23
2  Banglore    45